astb_relise/src/Catalogs/ПериодичностьВыдачиСИЗ/ПериодичностьВыдачиСИЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПериодичностьВыдачиСИЗ</name>
  <attributes>
    <name>ТипПериода</name>
    <type>
      <types>EnumRef.ДоступныеПериодыОтчета</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВПериоде</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

astb_relise/src/Enums/ВидыРасчетаНорм/ВидыРасчетаНорм.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыРасчетаНорм</name>
  <enumValues>
    <name>ДоИзноса</name>
  </enumValues>
  <enumValues>
    <name>Период</name>
  </enumValues>
  <enumValues>
    <name>Дежурный</name>
  </enumValues>
</mdclass:Enum>

astb_relise/src/Catalogs/ПериодичностьВыдачиСИЗ/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция РассчитатьПриоритетПериодичности(ТекущийОбъект) Экспорт
	
	Если ТекущийОбъект.ТипПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Год") Тогда
		ДополнительныйКоэффициент 	= 12;
		ПоказательТипаПериода 		= 0;
	Иначе
		ДополнительныйКоэффициент 	= 1;		
		ПоказательТипаПериода 		= 1;
	КонецЕсли;
	
	Если ТекущийОбъект.КоличествоПериодов = 0 Тогда
		ПоказательКоличестваПериодов 	= 0;
		ПоказательПериодичности 		= 0;
	Иначе
		ПоказательКоличестваПериодов 	= Окр(1000 / (ТекущийОбъект.КоличествоПериодов * ДополнительныйКоэффициент),0,РежимОкругления.Окр15как20); 
	    ПоказательПериодичности 		= Окр(100000000 * ТекущийОбъект.КоличествоВПериоде / ТекущийОбъект.КоличествоПериодов / ДополнительныйКоэффициент,0,РежимОкругления.Окр15как20);
	КонецЕсли;
	
	Возврат ПоказательПериодичности + ПоказательКоличестваПериодов + ПоказательТипаПериода; 
	
КонецФункции

Функция СформироватьНаименованиеПериодичности(ТекущийОбъект) Экспорт
	
	Возврат ПроцедурыРаботыСНормамиСервер.ПолучитьПредставлениеПериодичностиВыдачи(Перечисления.ВидыРасчетаНорм.Период,ТекущийОбъект.КоличествоВПериоде,ТекущийОбъект.ТипПериода,ТекущийОбъект.КоличествоПериодов);
	
КонецФункции
	
#КонецЕсли
